In [21]:
import pandas as pd
import numpy as np

In [22]:
dictionaryData = {"Istanbul": [30, 29, np.nan], "Ankara": [20, np.nan, 38], "Izmir": [40, 35, 38]}
weatherDataFrame = pd.DataFrame(dictionaryData)

In [23]:
weatherDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     35
2       NaN    38.0     38

In [24]:
weatherDataFrame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [25]:
weatherDataFrame.dropna(axis = 1)

   Izmir
0     40
1     35
2     38

In [26]:
newDictionaryData = {"Istanbul": [30, 29, np.nan], "Ankara": [20, np.nan, 38], "Izmir": [40, 35, 38], "Antalya": [45, np.nan, np.nan]}
newWeatherDataFrame = pd.DataFrame(newDictionaryData)

In [27]:
newWeatherDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     35      NaN
2       NaN    38.0     38      NaN

In [28]:
newWeatherDataFrame.dropna(axis = 1, thresh = 2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     35
2       NaN    38.0     38

In [29]:
newWeatherDataFrame.fillna(0)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     0.0     35      0.0
2       0.0    38.0     38      0.0

## GroupBy

In [30]:
salaryDictionary = {"Department": ["Software", "Sales", "Software", "HR", "HR", "Sales"], 
                    "Worker": ["Jane", "Kris", "Anya", "Hans", "Levi", "Wrang"], 
                    "Salary": [100, 100, 200, 150, 180, 90]}
salaryDataFrame = pd.DataFrame(salaryDictionary)

In [31]:
salaryDataFrame

  Department Worker  Salary
0   Software   Jane     100
1      Sales   Kris     100
2   Software   Anya     200
3         HR   Hans     150
4         HR   Levi     180
5      Sales  Wrang      90

In [35]:
groupObject = salaryDataFrame.groupby("Department")

In [36]:
groupObject.count()

            Worker  Salary
Department
HR               2       2
Sales            2       2
Software         2       2

In [37]:
groupObject.mean()

TypeError: agg function failed [how->mean,dtype->object]

In [38]:
groupObject.min()

           Worker  Salary
Department
HR           Hans     150
Sales        Kris      90
Software     Anya     100

In [39]:
groupObject.max()

           Worker  Salary
Department
HR           Levi     180
Sales       Wrang     100
Software     Jane     200

In [40]:
groupObject.describe()

           Salary
            count   mean        std    min    25%    50%    75%    max
Department
HR            2.0  165.0  21.213203  150.0  157.5  165.0  172.5  180.0
Sales         2.0   95.0   7.071068   90.0   92.5   95.0   97.5  100.0
Software      2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0